XinLiGH/STM32F4xx_USART_Example/User/USART/USART.c
#if (USART6_BufferSize_Tx && USART6_DMA_BufferSize_Tx) || (USART6_BufferSize_Rx && USART6_DMA_BufferSize_Rx)
static bool USART6_RCC_Flag = false, USART6_GPIO_Flag = false, USART6_NVIC_Flag = false;

#if USART6_BufferSize_Tx && USART6_DMA_BufferSize_Tx
static bool USART6_DMA_Tx_Flag = false, USART6_SendData_Flag = false;
static uint32_t USART6_SendData_P = NULL;
static uint8_t USART6_Buffer_Tx[USART6_BufferSize_Tx]         = {NULL};
static uint8_t USART6_DMA_Buffer_Tx[USART6_DMA_BufferSize_Tx] = {NULL};
#endif /* USART6_BufferSize_Tx && USART6_DMA_BufferSize_Tx */

#if USART6_BufferSize_Rx && USART6_DMA_BufferSize_Rx
static bool USART6_DMA_Rx_Flag = false;
static uint32_t USART6_ReceiveData_P = NULL;
static uint8_t USART6_Buffer_Rx[USART6_BufferSize_Rx]         = {NULL};
static uint8_t USART6_DMA_Buffer_Rx[USART6_DMA_BufferSize_Rx] = {NULL};
#endif /* USART6_BufferSize_Rx && USART6_DMA_BufferSize_Rx */
#endif /* (USART6_BufferSize_Tx && USART6_DMA_BufferSize_Tx) || (USART6_BufferSize_Rx && USART6_DMA_BufferSize_Rx) */

#if defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F413_423xx)
#if (USART7_BufferSize_Tx && USART7_DMA_BufferSize_Tx) || (USART7_BufferSize_Rx && USART7_DMA_BufferSize_Rx)
static bool USART7_RCC_Flag = false, USART7_GPIO_Flag = false, USART7_NVIC_Flag = false;

#if USART7_BufferSize_Tx && USART7_DMA_BufferSize_Tx
static bool USART7_DMA_Tx_Flag = false, USART7_SendData_Flag = false;
static uint32_t USART7_SendData_P = NULL;
static uint8_t USART7_Buffer_Tx[USART7_BufferSize_Tx]         = {NULL};
static uint8_t USART7_DMA_Buffer_Tx[USART7_DMA_BufferSize_Tx] = {NULL};
#endif /* USART7_BufferSize_Tx && USART7_DMA_BufferSize_Tx */

#if USART7_BufferSize_Rx && USART7_DMA_BufferSize_Rx
static bool USART7_DMA_Rx_Flag = false;
static uint32_t USART7_ReceiveData_P = NULL;
static uint8_t USART7_Buffer_Rx[USART7_BufferSize_Rx]         = {NULL};
static uint8_t USART7_DMA_Buffer_Rx[USART7_DMA_BufferSize_Rx] = {NULL};
#endif /* USART7_BufferSize_Rx && USART7_DMA_BufferSize_Rx */
#endif /* (USART7_BufferSize_Tx && USART7_DMA_BufferSize_Tx) || (USART7_BufferSize_Rx && USART7_DMA_BufferSize_Rx) */

#if (USART8_BufferSize_Tx && USART8_DMA_BufferSize_Tx) || (USART8_BufferSize_Rx && USART8_DMA_BufferSize_Rx)
static bool USART8_RCC_Flag = false, USART8_GPIO_Flag = false, USART8_NVIC_Flag = false;

#if USART8_BufferSize_Tx && USART8_DMA_BufferSize_Tx
static bool USART8_DMA_Tx_Flag = false, USART8_SendData_Flag = false;
static uint32_t USART8_SendData_P = NULL;
static uint8_t USART8_Buffer_Tx[USART8_BufferSize_Tx]         = {NULL};
static uint8_t USART8_DMA_Buffer_Tx[USART8_DMA_BufferSize_Tx] = {NULL};
#endif /* USART8_BufferSize_Tx && USART8_DMA_BufferSize_Tx */

#if USART8_BufferSize_Rx && USART8_DMA_BufferSize_Rx
static bool USART8_DMA_Rx_Flag = false;
static uint32_t USART8_ReceiveData_P = NULL;
static uint8_t USART8_Buffer_Rx[USART8_BufferSize_Rx]         = {NULL};
static uint8_t USART8_DMA_Buffer_Rx[USART8_DMA_BufferSize_Rx] = {NULL};
#endif /* USART8_BufferSize_Rx && USART8_DMA_BufferSize_Rx */
#endif /* (USART8_BufferSize_Tx && USART8_DMA_BufferSize_Tx) || (USART8_BufferSize_Rx && USART8_DMA_BufferSize_Rx) */
#endif /* STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F413_423xx */

#if defined(STM32F413_423xx)
#if (USART9_BufferSize_Tx && USART9_DMA_BufferSize_Tx) || (USART9_BufferSize_Rx && USART9_DMA_BufferSize_Rx)
static bool USART9_RCC_Flag = false, USART9_GPIO_Flag = false, USART9_NVIC_Flag = false;

#if USART9_BufferSize_Tx && USART9_DMA_BufferSize_Tx
static bool USART9_DMA_Tx_Flag = false, USART9_SendData_Flag = false;
static uint32_t USART9_SendData_P = NULL;
static uint8_t USART9_Buffer_Tx[USART9_BufferSize_Tx]         = {NULL};
static uint8_t USART9_DMA_Buffer_Tx[USART9_DMA_BufferSize_Tx] = {NULL};
#endif /* USART9_BufferSize_Tx && USART9_DMA_BufferSize_Tx */

#if USART9_BufferSize_Rx && USART9_DMA_BufferSize_Rx
static bool USART9_DMA_Rx_Flag = false;
static uint32_t USART9_ReceiveData_P = NULL;
static uint8_t USART9_Buffer_Rx[USART9_BufferSize_Rx]         = {NULL};
static uint8_t USART9_DMA_Buffer_Rx[USART9_DMA_BufferSize_Rx] = {NULL};
#endif /* USART9_BufferSize_Rx && USART9_DMA_BufferSize_Rx */
#endif /* (USART9_BufferSize_Tx && USART9_DMA_BufferSize_Tx) || (USART9_BufferSize_Rx && USART9_DMA_BufferSize_Rx) */

#if (USART10_BufferSize_Tx && USART10_DMA_BufferSize_Tx) || (USART10_BufferSize_Rx && USART10_DMA_BufferSize_Rx)
static bool USART10_RCC_Flag = false, USART10_GPIO_Flag = false, USART10_NVIC_Flag = false;

#if USART10_BufferSize_Tx && USART10_DMA_BufferSize_Tx
static bool USART10_DMA_Tx_Flag = false, USART10_SendData_Flag = false;
static uint32_t USART10_SendData_P = NULL;
static uint8_t USART10_Buffer_Tx[USART10_BufferSize_Tx]         = {NULL};
static uint8_t USART10_DMA_Buffer_Tx[USART10_DMA_BufferSize_Tx] = {NULL};
#endif /* USART10_BufferSize_Tx && USART10_DMA_BufferSize_Tx */

#if USART10_BufferSize_Rx && USART10_DMA_BufferSize_Rx
static bool USART10_DMA_Rx_Flag = false;
static uint32_t USART10_ReceiveData_P = NULL;
static uint8_t USART10_Buffer_Rx[USART10_BufferSize_Rx]         = {NULL};
static uint8_t USART10_DMA_Buffer_Rx[USART10_DMA_BufferSize_Rx] = {NULL};
#endif /* USART10_BufferSize_Rx && USART10_DMA_BufferSize_Rx */
#endif /* (USART10_BufferSize_Tx && USART10_DMA_BufferSize_Tx) || (USART10_BufferSize_Rx && USART10_DMA_BufferSize_Rx) */
#endif /* STM32F413_423xx */

/****************************************************************
 *                     Function declaration
*****************************************************************/
static void USART_DMA_TX_Configure(USART_TypeDef* USARTx);
static void USART_DMA_RX_Configure(USART_TypeDef* USARTx);
static void USART_DMA_TX_Unconfigure(USART_TypeDef* USARTx);
static void USART_DMA_RX_Unconfigure(USART_TypeDef* USARTx);
static void USART_NVIC_Configure(USART_TypeDef* USARTx);
static void USART_NVIC_Unconfigure(USART_TypeDef* USARTx);

/****************************************************************
 *                     Function definition
*****************************************************************/

/****************************************************************
 * Function:    USART_Configure
 * Description: USART configure.
 * Input:       USARTx:   Where x can be 1, 2, 3, 4, 5, 6, 7, 8, 9 or 10 to select the USART or UART peripheral.
 *              BaudRate: Communication baud rate.
 * Output:
 * Return:
*****************************************************************/
void USART_Configure(USART_TypeDef* USARTx, uint32_t BaudRate)
{
  uint16_t USART_Mode = NULL;             /* USART Mode definition */
  
  GPIO_InitTypeDef GPIO_InitStructure;    /* GPIO Init structure definition */
  USART_InitTypeDef USART_InitStructure;  /* USART Init Structure definition */
  
  if(USARTx == USART1)
  {
#if (USART1_BufferSize_Tx && USART1_DMA_BufferSize_Tx) || (USART1_BufferSize_Rx && USART1_DMA_BufferSize_Rx)
#if USART1_BufferSize_Tx && USART1_DMA_BufferSize_Tx
    USART_Mode          |= USART_Mode_Tx;
    USART1_SendData_Flag = false;
    USART1_SendData_P    = NULL;
#endif /* USART1_BufferSize_Tx && USART1_DMA_BufferSize_Tx */
    
#if USART1_BufferSize_Rx && USART1_DMA_BufferSize_Rx
    USART_Mode          |= USART_Mode_Rx;
    USART1_ReceiveData_P = NULL;
#endif /* USART1_BufferSize_Rx && USART1_DMA_BufferSize_Rx */
    
    if(USART1_RCC_Flag == false)
    {
      USART1_RCC_Flag = true;
      
      RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);  /* Enable USART1 clock */
    }
    
    if(USART1_GPIO_Flag == false)
    {
      USART1_GPIO_Flag = true;
      
      RCC_AHB1PeriphClockCmd(USART1_Tx_RCC_AHB1Periph_GPIO, ENABLE);  /* Enable USART1_Tx GPIO clock */
      RCC_AHB1PeriphClockCmd(USART1_Rx_RCC_AHB1Periph_GPIO, ENABLE);  /* Enable USART1_Rx GPIO clock */
      
