XinLiGH/STM32F4xx_USART_Example/User/USART/USART.c
    memcpy(USART4_Buffer_Tx + USART4_SendData_P, Data, Length); /* Copy memory */
    USART4_SendData_P += Length;
    
    if(USART4_SendData_Flag == false)
    {
      USART4_SendData_Flag = true;
      
      if(USART4_SendData_P > USART4_DMA_BufferSize_Tx)
      {
        memcpy(USART4_DMA_Buffer_Tx, USART4_Buffer_Tx, USART4_DMA_BufferSize_Tx);                                             /* Copy memory */
        memmove(USART4_Buffer_Tx, USART4_Buffer_Tx + USART4_DMA_BufferSize_Tx, USART4_SendData_P - USART4_DMA_BufferSize_Tx); /* Copy memory */
        
        DMA_ClearFlag(DMA1_Stream4, DMA_FLAG_TCIF4);                    /* Clears the DMA1 Stream4's pending flags. */
        DMA_Cmd(DMA1_Stream4, DISABLE);                                 /* Disables the specified DMA1 Stream4. */
        while(DMA_GetCmdStatus(DMA1_Stream4) != DISABLE);               /* Wait for the specified DMA1 Stream4 disable to finish. */
        DMA_SetCurrDataCounter(DMA1_Stream4, USART4_DMA_BufferSize_Tx); /* Writes the number of data units to be transferred on the DMA1 Stream4. */
        DMA_Cmd(DMA1_Stream4, ENABLE);                                  /* Enables the specified DMA1 Stream4. */
        
        USART4_SendData_P -= USART4_DMA_BufferSize_Tx;
      }
      else
      {
        memcpy(USART4_DMA_Buffer_Tx, USART4_Buffer_Tx, USART4_SendData_P); /* Copy memory */
        
        DMA_ClearFlag(DMA1_Stream4, DMA_FLAG_TCIF4);             /* Clears the DMA1 Stream4's pending flags. */
        DMA_Cmd(DMA1_Stream4, DISABLE);                          /* Disables the specified DMA1 Stream4. */
        while(DMA_GetCmdStatus(DMA1_Stream4) != DISABLE);        /* Wait for the specified DMA1 Stream4 disable to finish. */
        DMA_SetCurrDataCounter(DMA1_Stream4, USART4_SendData_P); /* Writes the number of data units to be transferred on the DMA1 Stream4. */
        DMA_Cmd(DMA1_Stream4, ENABLE);                           /* Enables the specified DMA1 Stream4. */
        
        USART4_SendData_P = NULL;
      }
    }
    
    return Length;
#endif /* USART4_BufferSize_Tx && USART4_DMA_BufferSize_Tx */
  }
  else if(USARTx == UART5)
  {
#if USART5_BufferSize_Tx && USART5_DMA_BufferSize_Tx
    if((USART5_RCC_Flag == false) || (USART5_GPIO_Flag == false) || (USART5_DMA_Tx_Flag == false) || (USART5_NVIC_Flag == false))
    {
      return NULL;
    }
    
    if(Length > (USART5_BufferSize_Tx - USART5_SendData_P))
    {
      return NULL;
    }
    
    memcpy(USART5_Buffer_Tx + USART5_SendData_P, Data, Length); /* Copy memory */
    USART5_SendData_P += Length;
    
    if(USART5_SendData_Flag == false)
    {
      USART5_SendData_Flag = true;
      
      if(USART5_SendData_P > USART5_DMA_BufferSize_Tx)
      {
        memcpy(USART5_DMA_Buffer_Tx, USART5_Buffer_Tx, USART5_DMA_BufferSize_Tx);                                             /* Copy memory */
        memmove(USART5_Buffer_Tx, USART5_Buffer_Tx + USART5_DMA_BufferSize_Tx, USART5_SendData_P - USART5_DMA_BufferSize_Tx); /* Copy memory */
        
        DMA_ClearFlag(DMA1_Stream7, DMA_FLAG_TCIF7);                    /* Clears the DMA1 Stream7's pending flags. */
        DMA_Cmd(DMA1_Stream7, DISABLE);                                 /* Disables the specified DMA1 Stream7. */
        while(DMA_GetCmdStatus(DMA1_Stream7) != DISABLE);               /* Wait for the specified DMA1 Stream7 disable to finish. */
        DMA_SetCurrDataCounter(DMA1_Stream7, USART5_DMA_BufferSize_Tx); /* Writes the number of data units to be transferred on the DMA1 Stream7. */
        DMA_Cmd(DMA1_Stream7, ENABLE);                                  /* Enables the specified DMA1 Stream7. */
        
        USART5_SendData_P -= USART5_DMA_BufferSize_Tx;
      }
      else
      {
        memcpy(USART5_DMA_Buffer_Tx, USART5_Buffer_Tx, USART5_SendData_P); /* Copy memory */
        
        DMA_ClearFlag(DMA1_Stream7, DMA_FLAG_TCIF7);             /* Clears the DMA1 Stream7's pending flags. */
        DMA_Cmd(DMA1_Stream7, DISABLE);                          /* Disables the specified DMA1 Stream7. */
        while(DMA_GetCmdStatus(DMA1_Stream7) != DISABLE);        /* Wait for the specified DMA1 Stream7 disable to finish. */
        DMA_SetCurrDataCounter(DMA1_Stream7, USART5_SendData_P); /* Writes the number of data units to be transferred on the DMA1 Stream7. */
        DMA_Cmd(DMA1_Stream7, ENABLE);                           /* Enables the specified DMA1 Stream7. */
        
        USART5_SendData_P = NULL;
      }
    }
    
    return Length;
#endif /* USART5_BufferSize_Tx && USART5_DMA_BufferSize_Tx */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F413_423xx */
  else if(USARTx == USART6)
  {
#if USART6_BufferSize_Tx && USART6_DMA_BufferSize_Tx
    if((USART6_RCC_Flag == false) || (USART6_GPIO_Flag == false) || (USART6_DMA_Tx_Flag == false) || (USART6_NVIC_Flag == false))
    {
      return NULL;
    }
    
    if(Length > (USART6_BufferSize_Tx - USART6_SendData_P))
    {
      return NULL;
    }
    
    memcpy(USART6_Buffer_Tx + USART6_SendData_P, Data, Length); /* Copy memory */
    USART6_SendData_P += Length;
    
    if(USART6_SendData_Flag == false)
    {
      USART6_SendData_Flag = true;
      
      if(USART6_SendData_P > USART6_DMA_BufferSize_Tx)
      {
        memcpy(USART6_DMA_Buffer_Tx, USART6_Buffer_Tx, USART6_DMA_BufferSize_Tx);                                             /* Copy memory */
        memmove(USART6_Buffer_Tx, USART6_Buffer_Tx + USART6_DMA_BufferSize_Tx, USART6_SendData_P - USART6_DMA_BufferSize_Tx); /* Copy memory */
        
        DMA_ClearFlag(DMA2_Stream6, DMA_FLAG_TCIF6);                    /* Clears the DMA2 Stream6's pending flags. */
        DMA_Cmd(DMA2_Stream6, DISABLE);                                 /* Disables the specified DMA2 Stream6. */
        while(DMA_GetCmdStatus(DMA2_Stream6) != DISABLE);               /* Wait for the specified DMA2 Stream6 disable to finish. */
        DMA_SetCurrDataCounter(DMA2_Stream6, USART6_DMA_BufferSize_Tx); /* Writes the number of data units to be transferred on the DMA2 Stream6. */
        DMA_Cmd(DMA2_Stream6, ENABLE);                                  /* Enables the specified DMA2 Stream6. */
        
