XinLiGH/STM32F4xx_USART_Example/User/USART/USART.c
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F413_423xx)
/****************************************************************
 * Function:    UART4_IRQHandler
 * Description: UART4 IRQ handler.
 * Input:
 * Output:
 * Return:
*****************************************************************/
void UART4_IRQHandler(void)
{
#if USART4_BufferSize_Tx && USART4_DMA_BufferSize_Tx
  if(USART_GetITStatus(UART4, USART_IT_TC) != RESET)  /* Checks whether the specified USART interrupt has occurred or not. */
  {
    USART_ClearITPendingBit(UART4, USART_IT_TC);      /* Clears the USARTx's interrupt pending bits. */
    
    if(USART4_SendData_P == NULL)
    {
      USART4_SendData_Flag = false;
      
      USART_SendDataFinishCallback(UART4);
    }
    else
    {
      if(USART4_SendData_P > USART4_DMA_BufferSize_Tx)
      {
        memcpy(USART4_DMA_Buffer_Tx, USART4_Buffer_Tx, USART4_DMA_BufferSize_Tx);                                             /* Copy memory */
        memmove(USART4_Buffer_Tx, USART4_Buffer_Tx + USART4_DMA_BufferSize_Tx, USART4_SendData_P - USART4_DMA_BufferSize_Tx); /* Copy memory */
        
        DMA_ClearFlag(DMA1_Stream4, DMA_FLAG_TCIF4);                    /* Clears the DMA1 Stream4's pending flags. */
        DMA_Cmd(DMA1_Stream4, DISABLE);                                 /* Disables the specified DMA1 Stream4. */
        while(DMA_GetCmdStatus(DMA1_Stream4) != DISABLE);               /* Wait for the specified DMA1 Stream4 disable to finish. */
        DMA_SetCurrDataCounter(DMA1_Stream4, USART4_DMA_BufferSize_Tx); /* Writes the number of data units to be transferred on the DMA1 Stream4. */
        DMA_Cmd(DMA1_Stream4, ENABLE);                                  /* Enables the specified DMA1 Stream4. */
        
        USART4_SendData_P -= USART4_DMA_BufferSize_Tx;
      }
      else
      {
        memcpy(USART4_DMA_Buffer_Tx, USART4_Buffer_Tx, USART4_SendData_P); /* Copy memory */
        
        DMA_ClearFlag(DMA1_Stream4, DMA_FLAG_TCIF4);             /* Clears the DMA1 Stream4's pending flags. */
        DMA_Cmd(DMA1_Stream4, DISABLE);                          /* Disables the specified DMA1 Stream4. */
        while(DMA_GetCmdStatus(DMA1_Stream4) != DISABLE);        /* Wait for the specified DMA1 Stream4 disable to finish. */
        DMA_SetCurrDataCounter(DMA1_Stream4, USART4_SendData_P); /* Writes the number of data units to be transferred on the DMA1 Stream4. */
        DMA_Cmd(DMA1_Stream4, ENABLE);                           /* Enables the specified DMA1 Stream4. */
        
        USART4_SendData_P = NULL;
      }
    }
  }
#endif /* USART4_BufferSize_Tx && USART4_DMA_BufferSize_Tx */
  
#if USART4_BufferSize_Rx && USART4_DMA_BufferSize_Rx
  if(USART_GetITStatus(UART4, USART_IT_IDLE) != RESET)  /* Checks whether the specified USART interrupt has occurred or not. */
  {
    USART_ReceiveData(UART4); /* Returns the most recent received data by the USARTx peripheral. */
    
    uint32_t number = USART4_DMA_BufferSize_Rx - DMA_GetCurrDataCounter(DMA1_Stream2); /* Returns the number of remaining data units in the current DMA1 Stream2 transfer. */
    
    if(number > (USART4_BufferSize_Rx - USART4_ReceiveData_P))
    {
      if(number < USART4_BufferSize_Rx)
      {
        memmove(USART4_Buffer_Rx, USART4_Buffer_Rx + (number - (USART4_BufferSize_Rx - USART4_ReceiveData_P)), USART4_BufferSize_Rx - number);  /* Copy memory */
        memcpy(USART4_Buffer_Rx + (USART4_BufferSize_Rx - number), USART4_DMA_Buffer_Rx, number);                                               /* Copy memory */
      }
      else
      {
        memcpy(USART4_Buffer_Rx, USART4_DMA_Buffer_Rx + (number - USART4_BufferSize_Rx), USART4_BufferSize_Rx); /* Copy memory */
      }
      
      USART4_ReceiveData_P = USART4_BufferSize_Rx;
    }
    else
    {
      memcpy(USART4_Buffer_Rx + USART4_ReceiveData_P, USART4_DMA_Buffer_Rx, number); /* Copy memory */
      
      USART4_ReceiveData_P += number;
    }
    
    DMA_Cmd(DMA1_Stream2, DISABLE);                                 /* Disables the specified DMA1 Stream2. */
    while(DMA_GetCmdStatus(DMA1_Stream2) != DISABLE);               /* Wait for the specified DMA1 Stream2 disable to finish. */
    DMA_SetCurrDataCounter(DMA1_Stream2, USART4_DMA_BufferSize_Rx); /* Writes the number of data units to be transferred on the DMA1 Stream2. */
    DMA_Cmd(DMA1_Stream2, ENABLE);                                  /* Enables the specified DMA1 Stream2. */
    
    USART_ReceiveDataFinishCallback(UART4);
  }
#endif /* USART4_BufferSize_Rx && USART4_DMA_BufferSize_Rx */
}

/****************************************************************
 * Function:    UART5_IRQHandler
 * Description: UART5 IRQ handler.
 * Input:
 * Output:
 * Return:
*****************************************************************/
void UART5_IRQHandler(void)
{
#if USART5_BufferSize_Tx && USART5_DMA_BufferSize_Tx
  if(USART_GetITStatus(UART5, USART_IT_TC) != RESET)  /* Checks whether the specified USART interrupt has occurred or not. */
  {
    USART_ClearITPendingBit(UART5, USART_IT_TC);      /* Clears the USARTx's interrupt pending bits. */
    
    if(USART5_SendData_P == NULL)
    {
      USART5_SendData_Flag = false;
      
      USART_SendDataFinishCallback(UART5);
    }
    else
    {
      if(USART5_SendData_P > USART5_DMA_BufferSize_Tx)
      {
        memcpy(USART5_DMA_Buffer_Tx, USART5_Buffer_Tx, USART5_DMA_BufferSize_Tx);                                             /* Copy memory */
        memmove(USART5_Buffer_Tx, USART5_Buffer_Tx + USART5_DMA_BufferSize_Tx, USART5_SendData_P - USART5_DMA_BufferSize_Tx); /* Copy memory */
        
        DMA_ClearFlag(DMA1_Stream7, DMA_FLAG_TCIF7);                    /* Clears the DMA1 Stream7's pending flags. */
        DMA_Cmd(DMA1_Stream7, DISABLE);                                 /* Disables the specified DMA1 Stream7. */
        while(DMA_GetCmdStatus(DMA1_Stream7) != DISABLE);               /* Wait for the specified DMA1 Stream7 disable to finish. */
        DMA_SetCurrDataCounter(DMA1_Stream7, USART5_DMA_BufferSize_Tx); /* Writes the number of data units to be transferred on the DMA1 Stream7. */
        DMA_Cmd(DMA1_Stream7, ENABLE);                                  /* Enables the specified DMA1 Stream7. */
        
