XinLiGH/STM32F4xx_USART_Example/User/USART/USART.c
      USART6_ReceiveData_P += number;
    }
    
    DMA_Cmd(DMA2_Stream1, DISABLE);                                 /* Disables the specified DMA2 Stream1. */
    while(DMA_GetCmdStatus(DMA2_Stream1) != DISABLE);               /* Wait for the specified DMA2 Stream1 disable to finish. */
    DMA_SetCurrDataCounter(DMA2_Stream1, USART6_DMA_BufferSize_Rx); /* Writes the number of data units to be transferred on the DMA2 Stream1. */
    DMA_Cmd(DMA2_Stream1, ENABLE);                                  /* Enables the specified DMA2 Stream1. */
    
    USART_ReceiveDataFinishCallback(USART6);
  }
#endif /* USART6_BufferSize_Rx && USART6_DMA_BufferSize_Rx */
}

#if defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F413_423xx)
/****************************************************************
 * Function:    UART7_IRQHandler
 * Description: UART7 IRQ handler.
 * Input:
 * Output:
 * Return:
*****************************************************************/
void UART7_IRQHandler(void)
{
#if USART7_BufferSize_Tx && USART7_DMA_BufferSize_Tx
  if(USART_GetITStatus(UART7, USART_IT_TC) != RESET)  /* Checks whether the specified USART interrupt has occurred or not. */
  {
    USART_ClearITPendingBit(UART7, USART_IT_TC);      /* Clears the USARTx's interrupt pending bits. */
    
    if(USART7_SendData_P == NULL)
    {
      USART7_SendData_Flag = false;
      
      USART_SendDataFinishCallback(UART7);
    }
    else
    {
      if(USART7_SendData_P > USART7_DMA_BufferSize_Tx)
      {
        memcpy(USART7_DMA_Buffer_Tx, USART7_Buffer_Tx, USART7_DMA_BufferSize_Tx);                                             /* Copy memory */
        memmove(USART7_Buffer_Tx, USART7_Buffer_Tx + USART7_DMA_BufferSize_Tx, USART7_SendData_P - USART7_DMA_BufferSize_Tx); /* Copy memory */
        
        DMA_ClearFlag(DMA1_Stream1, DMA_FLAG_TCIF1);                    /* Clears the DMA1 Stream1's pending flags. */
        DMA_Cmd(DMA1_Stream1, DISABLE);                                 /* Disables the specified DMA1 Stream1. */
        while(DMA_GetCmdStatus(DMA1_Stream1) != DISABLE);               /* Wait for the specified DMA1 Stream1 disable to finish. */
        DMA_SetCurrDataCounter(DMA1_Stream1, USART7_DMA_BufferSize_Tx); /* Writes the number of data units to be transferred on the DMA1 Stream1. */
        DMA_Cmd(DMA1_Stream1, ENABLE);                                  /* Enables the specified DMA1 Stream1. */
        
        USART7_SendData_P -= USART7_DMA_BufferSize_Tx;
      }
      else
      {
        memcpy(USART7_DMA_Buffer_Tx, USART7_Buffer_Tx, USART7_SendData_P); /* Copy memory */
        
        DMA_ClearFlag(DMA1_Stream1, DMA_FLAG_TCIF1);             /* Clears the DMA1 Stream1's pending flags. */
        DMA_Cmd(DMA1_Stream1, DISABLE);                          /* Disables the specified DMA1 Stream1. */
        while(DMA_GetCmdStatus(DMA1_Stream1) != DISABLE);        /* Wait for the specified DMA1 Stream1 disable to finish. */
        DMA_SetCurrDataCounter(DMA1_Stream1, USART7_SendData_P); /* Writes the number of data units to be transferred on the DMA1 Stream1. */
        DMA_Cmd(DMA1_Stream1, ENABLE);                           /* Enables the specified DMA1 Stream1. */
        
        USART7_SendData_P = NULL;
      }
    }
  }
#endif /* USART7_BufferSize_Tx && USART7_DMA_BufferSize_Tx */
  
#if USART7_BufferSize_Rx && USART7_DMA_BufferSize_Rx
  if(USART_GetITStatus(UART7, USART_IT_IDLE) != RESET)  /* Checks whether the specified USART interrupt has occurred or not. */
  {
    USART_ReceiveData(UART7); /* Returns the most recent received data by the USARTx peripheral. */
    
    uint32_t number = USART7_DMA_BufferSize_Rx - DMA_GetCurrDataCounter(DMA1_Stream3); /* Returns the number of remaining data units in the current DMA1 Stream3 transfer. */
    
    if(number > (USART7_BufferSize_Rx - USART7_ReceiveData_P))
    {
      if(number < USART7_BufferSize_Rx)
      {
        memmove(USART7_Buffer_Rx, USART7_Buffer_Rx + (number - (USART7_BufferSize_Rx - USART7_ReceiveData_P)), USART7_BufferSize_Rx - number);  /* Copy memory */
        memcpy(USART7_Buffer_Rx + (USART7_BufferSize_Rx - number), USART7_DMA_Buffer_Rx, number);                                               /* Copy memory */
      }
      else
      {
        memcpy(USART7_Buffer_Rx, USART7_DMA_Buffer_Rx + (number - USART7_BufferSize_Rx), USART7_BufferSize_Rx); /* Copy memory */
      }
      
      USART7_ReceiveData_P = USART7_BufferSize_Rx;
    }
    else
    {
      memcpy(USART7_Buffer_Rx + USART7_ReceiveData_P, USART7_DMA_Buffer_Rx, number); /* Copy memory */
      
      USART7_ReceiveData_P += number;
    }
    
    DMA_Cmd(DMA1_Stream3, DISABLE);                                 /* Disables the specified DMA1 Stream3. */
    while(DMA_GetCmdStatus(DMA1_Stream3) != DISABLE);               /* Wait for the specified DMA1 Stream3 disable to finish. */
    DMA_SetCurrDataCounter(DMA1_Stream3, USART7_DMA_BufferSize_Rx); /* Writes the number of data units to be transferred on the DMA1 Stream3. */
    DMA_Cmd(DMA1_Stream3, ENABLE);                                  /* Enables the specified DMA1 Stream3. */
    
    USART_ReceiveDataFinishCallback(UART7);
  }
#endif /* USART7_BufferSize_Rx && USART7_DMA_BufferSize_Rx */
}

/****************************************************************
 * Function:    UART8_IRQHandler
 * Description: UART8 IRQ handler.
 * Input:
 * Output:
 * Return:
*****************************************************************/
void UART8_IRQHandler(void)
{
#if USART8_BufferSize_Tx && USART8_DMA_BufferSize_Tx
  if(USART_GetITStatus(UART8, USART_IT_TC) != RESET)  /* Checks whether the specified USART interrupt has occurred or not. */
  {
    USART_ClearITPendingBit(UART8, USART_IT_TC);      /* Clears the USARTx's interrupt pending bits. */
    
    if(USART8_SendData_P == NULL)
    {
      USART8_SendData_Flag = false;
      
      USART_SendDataFinishCallback(UART8);
    }
    else
    {
      if(USART8_SendData_P > USART8_DMA_BufferSize_Tx)
      {
        memcpy(USART8_DMA_Buffer_Tx, USART8_Buffer_Tx, USART8_DMA_BufferSize_Tx);                                             /* Copy memory */
        memmove(USART8_Buffer_Tx, USART8_Buffer_Tx + USART8_DMA_BufferSize_Tx, USART8_SendData_P - USART8_DMA_BufferSize_Tx); /* Copy memory */
        
        DMA_ClearFlag(DMA1_Stream0, DMA_FLAG_TCIF0);                    /* Clears the DMA1 Stream0's pending flags. */
        DMA_Cmd(DMA1_Stream0, DISABLE);                                 /* Disables the specified DMA1 Stream0. */
        while(DMA_GetCmdStatus(DMA1_Stream0) != DISABLE);               /* Wait for the specified DMA1 Stream0 disable to finish. */
        DMA_SetCurrDataCounter(DMA1_Stream0, USART8_DMA_BufferSize_Tx); /* Writes the number of data units to be transferred on the DMA1 Stream0. */
        DMA_Cmd(DMA1_Stream0, ENABLE);                                  /* Enables the specified DMA1 Stream0. */
        
        USART8_SendData_P -= USART8_DMA_BufferSize_Tx;
      }
      else
      {
        memcpy(USART8_DMA_Buffer_Tx, USART8_Buffer_Tx, USART8_SendData_P); /* Copy memory */
        
        DMA_ClearFlag(DMA1_Stream0, DMA_FLAG_TCIF0);             /* Clears the DMA1 Stream0's pending flags. */
        DMA_Cmd(DMA1_Stream0, DISABLE);                          /* Disables the specified DMA1 Stream0. */
        while(DMA_GetCmdStatus(DMA1_Stream0) != DISABLE);        /* Wait for the specified DMA1 Stream0 disable to finish. */
        DMA_SetCurrDataCounter(DMA1_Stream0, USART8_SendData_P); /* Writes the number of data units to be transferred on the DMA1 Stream0. */
        DMA_Cmd(DMA1_Stream0, ENABLE);                           /* Enables the specified DMA1 Stream0. */
        
        USART8_SendData_P = NULL;
      }
    }
  }
#endif /* USART8_BufferSize_Tx && USART8_DMA_BufferSize_Tx */
  
