XinLiGH/STM32F4xx_USART_Example/User/USART/USART.c
#if USART8_BufferSize_Rx && USART8_DMA_BufferSize_Rx
  if(USART_GetITStatus(UART8, USART_IT_IDLE) != RESET)  /* Checks whether the specified USART interrupt has occurred or not. */
  {
    USART_ReceiveData(UART8); /* Returns the most recent received data by the USARTx peripheral. */
    
    uint32_t number = USART8_DMA_BufferSize_Rx - DMA_GetCurrDataCounter(DMA1_Stream6); /* Returns the number of remaining data units in the current DMA1 Stream6 transfer. */
    
    if(number > (USART8_BufferSize_Rx - USART8_ReceiveData_P))
    {
      if(number < USART8_BufferSize_Rx)
      {
        memmove(USART8_Buffer_Rx, USART8_Buffer_Rx + (number - (USART8_BufferSize_Rx - USART8_ReceiveData_P)), USART8_BufferSize_Rx - number);  /* Copy memory */
        memcpy(USART8_Buffer_Rx + (USART8_BufferSize_Rx - number), USART8_DMA_Buffer_Rx, number);                                               /* Copy memory */
      }
      else
      {
        memcpy(USART8_Buffer_Rx, USART8_DMA_Buffer_Rx + (number - USART8_BufferSize_Rx), USART8_BufferSize_Rx); /* Copy memory */
      }
      
      USART8_ReceiveData_P = USART8_BufferSize_Rx;
    }
    else
    {
      memcpy(USART8_Buffer_Rx + USART8_ReceiveData_P, USART8_DMA_Buffer_Rx, number); /* Copy memory */
      
      USART8_ReceiveData_P += number;
    }
    
    DMA_Cmd(DMA1_Stream6, DISABLE);                                 /* Disables the specified DMA1 Stream6. */
    while(DMA_GetCmdStatus(DMA1_Stream6) != DISABLE);               /* Wait for the specified DMA1 Stream6 disable to finish. */
    DMA_SetCurrDataCounter(DMA1_Stream6, USART8_DMA_BufferSize_Rx); /* Writes the number of data units to be transferred on the DMA1 Stream6. */
    DMA_Cmd(DMA1_Stream6, ENABLE);                                  /* Enables the specified DMA1 Stream6. */
    
    USART_ReceiveDataFinishCallback(UART8);
  }
#endif /* USART8_BufferSize_Rx && USART8_DMA_BufferSize_Rx */
}
#endif /* STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F413_423xx */

#if defined(STM32F413_423xx)
/****************************************************************
 * Function:    UART9_IRQHandler
 * Description: UART9 IRQ handler.
 * Input:
 * Output:
 * Return:
*****************************************************************/
void UART9_IRQHandler(void)
{
#if USART9_BufferSize_Tx && USART9_DMA_BufferSize_Tx
  if(USART_GetITStatus(UART9, USART_IT_TC) != RESET)  /* Checks whether the specified USART interrupt has occurred or not. */
  {
    USART_ClearITPendingBit(UART9, USART_IT_TC);      /* Clears the USARTx's interrupt pending bits. */
    
    if(USART9_SendData_P == NULL)
    {
      USART9_SendData_Flag = false;
      
      USART_SendDataFinishCallback(UART9);
    }
    else
    {
      if(USART9_SendData_P > USART9_DMA_BufferSize_Tx)
      {
        memcpy(USART9_DMA_Buffer_Tx, USART9_Buffer_Tx, USART9_DMA_BufferSize_Tx);                                             /* Copy memory */
        memmove(USART9_Buffer_Tx, USART9_Buffer_Tx + USART9_DMA_BufferSize_Tx, USART9_SendData_P - USART9_DMA_BufferSize_Tx); /* Copy memory */
        
        DMA_ClearFlag(DMA2_Stream0, DMA_FLAG_TCIF0);                    /* Clears the DMA2 Stream0's pending flags. */
        DMA_Cmd(DMA2_Stream0, DISABLE);                                 /* Disables the specified DMA2 Stream0. */
        while(DMA_GetCmdStatus(DMA2_Stream0) != DISABLE);               /* Wait for the specified DMA2 Stream0 disable to finish. */
        DMA_SetCurrDataCounter(DMA2_Stream0, USART9_DMA_BufferSize_Tx); /* Writes the number of data units to be transferred on the DMA2 Stream0. */
        DMA_Cmd(DMA2_Stream0, ENABLE);                                  /* Enables the specified DMA2 Stream0. */
        
        USART9_SendData_P -= USART9_DMA_BufferSize_Tx;
      }
      else
      {
        memcpy(USART9_DMA_Buffer_Tx, USART9_Buffer_Tx, USART9_SendData_P); /* Copy memory */
        
        DMA_ClearFlag(DMA2_Stream0, DMA_FLAG_TCIF0);             /* Clears the DMA2 Stream0's pending flags. */
        DMA_Cmd(DMA2_Stream0, DISABLE);                          /* Disables the specified DMA2 Stream0. */
        while(DMA_GetCmdStatus(DMA2_Stream0) != DISABLE);        /* Wait for the specified DMA2 Stream0 disable to finish. */
        DMA_SetCurrDataCounter(DMA2_Stream0, USART9_SendData_P); /* Writes the number of data units to be transferred on the DMA2 Stream0. */
        DMA_Cmd(DMA2_Stream0, ENABLE);                           /* Enables the specified DMA2 Stream0. */
        
        USART9_SendData_P = NULL;
      }
    }
  }
#endif /* USART9_BufferSize_Tx && USART9_DMA_BufferSize_Tx */
  
#if USART9_BufferSize_Rx && USART9_DMA_BufferSize_Rx
  if(USART_GetITStatus(UART9, USART_IT_IDLE) != RESET)  /* Checks whether the specified USART interrupt has occurred or not. */
  {
    USART_ReceiveData(UART9); /* Returns the most recent received data by the USARTx peripheral. */
    
    uint32_t number = USART9_DMA_BufferSize_Rx - DMA_GetCurrDataCounter(DMA2_Stream7); /* Returns the number of remaining data units in the current DMA2 Stream7 transfer. */
    
    if(number > (USART9_BufferSize_Rx - USART9_ReceiveData_P))
    {
      if(number < USART9_BufferSize_Rx)
      {
        memmove(USART9_Buffer_Rx, USART9_Buffer_Rx + (number - (USART9_BufferSize_Rx - USART9_ReceiveData_P)), USART9_BufferSize_Rx - number);  /* Copy memory */
        memcpy(USART9_Buffer_Rx + (USART9_BufferSize_Rx - number), USART9_DMA_Buffer_Rx, number);                                               /* Copy memory */
      }
      else
      {
        memcpy(USART9_Buffer_Rx, USART9_DMA_Buffer_Rx + (number - USART9_BufferSize_Rx), USART9_BufferSize_Rx); /* Copy memory */
      }
      
      USART9_ReceiveData_P = USART9_BufferSize_Rx;
    }
    else
    {
      memcpy(USART9_Buffer_Rx + USART9_ReceiveData_P, USART9_DMA_Buffer_Rx, number); /* Copy memory */
      
      USART9_ReceiveData_P += number;
    }
    
    DMA_Cmd(DMA2_Stream7, DISABLE);                                 /* Disables the specified DMA2 Stream7. */
    while(DMA_GetCmdStatus(DMA2_Stream7) != DISABLE);               /* Wait for the specified DMA2 Stream7 disable to finish. */
    DMA_SetCurrDataCounter(DMA2_Stream7, USART9_DMA_BufferSize_Rx); /* Writes the number of data units to be transferred on the DMA2 Stream7. */
    DMA_Cmd(DMA2_Stream7, ENABLE);                                  /* Enables the specified DMA2 Stream7. */
    
    USART_ReceiveDataFinishCallback(UART9);
  }
#endif /* USART9_BufferSize_Rx && USART9_DMA_BufferSize_Rx */
}

/****************************************************************
 * Function:    UART10_IRQHandler
 * Description: UART10 IRQ handler.
 * Input:
 * Output:
 * Return:
*****************************************************************/
void UART10_IRQHandler(void)
{
#if USART10_BufferSize_Tx && USART10_DMA_BufferSize_Tx
  if(USART_GetITStatus(UART10, USART_IT_TC) != RESET) /* Checks whether the specified USART interrupt has occurred or not. */
  {
    USART_ClearITPendingBit(UART10, USART_IT_TC);     /* Clears the USARTx's interrupt pending bits. */
    
