XinLiGH/STM32F4xx_USART_Example/User/USART/USART.c
    if(USART10_SendData_P == NULL)
    {
      USART10_SendData_Flag = false;
      
      USART_SendDataFinishCallback(UART10);
    }
    else
    {
      if(USART10_SendData_P > USART10_DMA_BufferSize_Tx)
      {
        memcpy(USART10_DMA_Buffer_Tx, USART10_Buffer_Tx, USART10_DMA_BufferSize_Tx);                                               /* Copy memory */
        memmove(USART10_Buffer_Tx, USART10_Buffer_Tx + USART10_DMA_BufferSize_Tx, USART10_SendData_P - USART10_DMA_BufferSize_Tx); /* Copy memory */
        
        DMA_ClearFlag(DMA2_Stream7, DMA_FLAG_TCIF7);                      /* Clears the DMA2 Stream7's pending flags. */
        DMA_Cmd(DMA2_Stream7, DISABLE);                                   /* Disables the specified DMA2 Stream7. */
        while(DMA_GetCmdStatus(DMA2_Stream7) != DISABLE);                 /* Wait for the specified DMA2 Stream7 disable to finish. */
        DMA_SetCurrDataCounter(DMA2_Stream7, USART10_DMA_BufferSize_Tx);  /* Writes the number of data units to be transferred on the DMA2 Stream7. */
        DMA_Cmd(DMA2_Stream7, ENABLE);                                    /* Enables the specified DMA2 Stream7. */
        
        USART10_SendData_P -= USART10_DMA_BufferSize_Tx;
      }
      else
      {
        memcpy(USART10_DMA_Buffer_Tx, USART10_Buffer_Tx, USART10_SendData_P); /* Copy memory */
        
        DMA_ClearFlag(DMA2_Stream7, DMA_FLAG_TCIF7);               /* Clears the DMA2 Stream7's pending flags. */
        DMA_Cmd(DMA2_Stream7, DISABLE);                            /* Disables the specified DMA2 Stream7. */
        while(DMA_GetCmdStatus(DMA2_Stream7) != DISABLE);          /* Wait for the specified DMA2 Stream7 disable to finish. */
        DMA_SetCurrDataCounter(DMA2_Stream7, USART10_SendData_P);  /* Writes the number of data units to be transferred on the DMA2 Stream7. */
        DMA_Cmd(DMA2_Stream7, ENABLE);                             /* Enables the specified DMA2 Stream7. */
        
        USART10_SendData_P = NULL;
      }
    }
  }
#endif /* USART10_BufferSize_Tx && USART10_DMA_BufferSize_Tx */
  
#if USART10_BufferSize_Rx && USART10_DMA_BufferSize_Rx
  if(USART_GetITStatus(UART10, USART_IT_IDLE) != RESET) /* Checks whether the specified USART interrupt has occurred or not. */
  {
    USART_ReceiveData(UART10);  /* Returns the most recent received data by the USARTx peripheral. */
    
    uint32_t number = USART10_DMA_BufferSize_Rx - DMA_GetCurrDataCounter(DMA2_Stream0); /* Returns the number of remaining data units in the current DMA2 Stream0 transfer. */
    
    if(number > (USART10_BufferSize_Rx - USART10_ReceiveData_P))
    {
      if(number < USART10_BufferSize_Rx)
      {
        memmove(USART10_Buffer_Rx, USART10_Buffer_Rx + (number - (USART10_BufferSize_Rx - USART10_ReceiveData_P)), USART10_BufferSize_Rx - number);  /* Copy memory */
        memcpy(USART10_Buffer_Rx + (USART10_BufferSize_Rx - number), USART10_DMA_Buffer_Rx, number);                                                 /* Copy memory */
      }
      else
      {
        memcpy(USART10_Buffer_Rx, USART10_DMA_Buffer_Rx + (number - USART10_BufferSize_Rx), USART10_BufferSize_Rx); /* Copy memory */
      }
      
      USART10_ReceiveData_P = USART10_BufferSize_Rx;
    }
    else
    {
      memcpy(USART10_Buffer_Rx + USART10_ReceiveData_P, USART10_DMA_Buffer_Rx, number); /* Copy memory */
      
      USART10_ReceiveData_P += number;
    }
    
    DMA_Cmd(DMA2_Stream0, DISABLE);                                   /* Disables the specified DMA2 Stream0. */
    while(DMA_GetCmdStatus(DMA2_Stream0) != DISABLE);                 /* Writes the number of data units to be transferred on the DMA2 Stream0. */
    DMA_SetCurrDataCounter(DMA2_Stream0, USART10_DMA_BufferSize_Rx);  /* Writes the number of data units to be transferred on the DMA2 Stream0. */
    DMA_Cmd(DMA2_Stream0, ENABLE);                                    /* Enables the specified DMA2 Stream0. */
    
    USART_ReceiveDataFinishCallback(UART10);
  }
#endif /* USART10_BufferSize_Rx && USART10_DMA_BufferSize_Rx */
}
#endif /* STM32F413_423xx */

/****************************************************************
 * Function:    USART_SendDataFinishCallback
 * Description: USART send data finish callback.
 * Input:       USARTx: Where x can be 1, 2, 3, 4, 5, 6, 7, 8, 9 or 10 to select the USART or UART peripheral.
 * Output:
 * Return:
*****************************************************************/
__weak void USART_SendDataFinishCallback(USART_TypeDef* USARTx)
{
  
}

/****************************************************************
 * Function:    USART_ReceiveDataFinishCallback
 * Description: USART receive data finish callback.
 * Input:       USARTx: Where x can be 1, 2, 3, 4, 5, 6, 7, 8, 9 or 10 to select the USART or UART peripheral.
 * Output:
 * Return:
*****************************************************************/
__weak void USART_ReceiveDataFinishCallback(USART_TypeDef* USARTx)
{
  
}
